In [9]:
import pandas as pd
import numpy as np
df=pd.DataFrame(np.arange(0,20).reshape(5,4))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [14]:

df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['R1','R2','R3','R4','R5'],columns=['C1','C2','C3','C4'])
df

    C1  C2  C3  C4
R1   0   1   2   3
R2   4   5   6   7
R3   8   9  10  11
R4  12  13  14  15
R5  16  17  18  19

In [16]:
df.head()

    C1  C2  C3  C4
R1   0   1   2   3
R2   4   5   6   7
R3   8   9  10  11
R4  12  13  14  15
R5  16  17  18  19

In [19]:
df.to_csv('test1.csv')

In [21]:
df.isnull().sum()

C1    0
C2    0
C3    0
C4    0
dtype: int64

In [23]:
df

    C1  C2  C3  C4
R1   0   1   2   3
R2   4   5   6   7
R3   8   9  10  11
R4  12  13  14  15
R5  16  17  18  19

In [25]:
#to count unique values (categories)

df['C1'].value_counts()

12    1
4     1
16    1
8     1
0     1
Name: C1, dtype: int64

In [27]:
df['C1'].unique()

array([ 0,  4,  8, 12, 16])

In [32]:
df[['C3','C4']]

    C3  C4
R1   2   3
R2   6   7
R3  10  11
R4  14  15
R5  18  19

In [39]:
#read csv file
df=pd.read_csv('jewelry_customers.csv')
df.head()

   Age  Income  SpendingScore       Savings
0   58   77769       0.791329   6559.829923
1   59   81799       0.791082   5417.661426
2   62   74751       0.702657   9258.992965
3   59   74373       0.765680   7346.334504
4   87   17760       0.348778  16869.507130

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 505 entries, 0 to 504
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Age            505 non-null    int64
 1   Income         505 non-null    int64
 2   SpendingScore  505 non-null    float64
 3   Savings        505 non-null    float64
dtypes: float64(2), int64(2)
memory usage: 15.9 KB

In [43]:
df.describe()

              Age         Income  SpendingScore       Savings
count  505.000000     505.000000     505.000000    505.000000
mean    59.019802   75513.291089       0.505083  11862.455867
std     24.140043   35992.922184       0.259634   4949.229253
min     17.000000   12000.000000       0.000000      0.000000
25%     34.000000   34529.000000       0.304792   6828.709702
50%     59.000000   75078.000000       0.368215  14209.932802
75%     85.000000  107100.000000       0.768279  16047.268331
max     97.000000  142000.000000       1.000000  20000.000000

In [44]:
df['Age'].value_counts()

59    25
88    20
58    19
91    19
87    19
      ..
95     1
54     1
51     1
44     1
97     1
Name: Age, Length: 61, dtype: int64